added deployment files
